driver-tests/bpelse/scenarios/CatalogSelection/CatalogComApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cdc="http://xml.netbeans.org/schema/cdcatalog">
  <soapenv:Body>
    <cdc:cdcatalog>
      <!--1 or more repetitions:-->
      <cdc:cd>
        <cdc:title>Everything is love</cdc:title>
        <cdc:artist>Kelly clarkson</cdc:artist>
        <cdc:country>USA</cdc:country>
        <cdc:company>Warner Brothers</cdc:company>
        <cdc:price>19.90</cdc:price>
        <cdc:year>1994</cdc:year>
      </cdc:cd>
      <cdc:cd>
        <cdc:title>Thriller</cdc:title>
        <cdc:artist>Micheal Jackson</cdc:artist>
        <cdc:country>USA</cdc:country>
        <cdc:company>Sony</cdc:company>
        <cdc:price>15.90</cdc:price>
        <cdc:year>1980</cdc:year>
      </cdc:cd>      
      <cdc:cd>
        <cdc:title>For the good times</cdc:title>
        <cdc:artist>Kenny Rogers</cdc:artist>
        <cdc:country>USA</cdc:country>
        <cdc:company>BMG</cdc:company>
        <cdc:price>9.75</cdc:price>
        <cdc:year>1966</cdc:year>
     </cdc:cd>
      <cdc:cd>
        <cdc:title>Revolution</cdc:title>
        <cdc:artist>Micheal Jackson</cdc:artist>
        <cdc:country>USA</cdc:country>
        <cdc:company>Sony</cdc:company>
        <cdc:price>35.99</cdc:price>
        <cdc:year>1988</cdc:year>
      </cdc:cd>  
     <cdc:cd>
        <cdc:title>Lonley Hearts Club</cdc:title>
        <cdc:artist>Beatles</cdc:artist>
        <cdc:country>UK</cdc:country>
        <cdc:company>BMG</cdc:company>
        <cdc:price>19.75</cdc:price>
        <cdc:year>1964</cdc:year>
    </cdc:cd>
      
      <cdc:cd>
        <cdc:title>Bille Jean</cdc:title>
        <cdc:artist>Micheal Jackson</cdc:artist>
        <cdc:country>USA</cdc:country>
        <cdc:company>Sony</cdc:company>
        <cdc:price>5.90</cdc:price>
        <cdc:year>1998</cdc:year>
      </cdc:cd>      

      <cdc:filterartist>Micheal Jackson</cdc:filterartist>
    </cdc:cdcatalog>
  </soapenv:Body>
</soapenv:Envelope>