driver-tests/bpelse/scenarios/CatalogSelection/CatalogComApp/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns:artistinfo xmlns:ns="http://xml.netbeans.org/schema/artistCollection">
      <ns:name>Micheal Jackson</ns:name>
      <ns:album>
        <ns:title>Thriller</ns:title>
        <ns:price>15.90</ns:price>
        <ns:year>1980</ns:year>
      </ns:album>
      <ns:album>
        <ns:title>Revolution</ns:title>
        <ns:price>35.99</ns:price>
        <ns:year>1988</ns:year>
      </ns:album>
      <ns:album>
        <ns:title>Bille Jean</ns:title>
        <ns:price>5.90</ns:price>
        <ns:year>1998</ns:year>
      </ns:album>
    </ns:artistinfo>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
